CSI API ETABS v1

# cAreaElmGetLocalAxes Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetLocalAxes(
    	string Name,
    	ref double Ang
    )

    Function GetLocalAxes (
    	Name As String,
    	ByRef Ang As Double
    ) As Integer

    Dim instance As cAreaElm
    Dim Name As String
    Dim Ang As Double
    Dim returnValue As Integer

    returnValue = instance.GetLocalAxes(Name,
    	Ang)

    int GetLocalAxes(
    	String^ Name,
    	double% Ang
    )

    abstract GetLocalAxes :
            Name : string *
            Ang : float byref -> int

#### Parameters

Name

    Type: SystemString

Ang

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cAreaElm Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com